OdCmEntityColor.lookUpRGB(System.Byte)
\details
Converts the specified color index (ACI value) to an RGB value.
\remarks
For converting, this method uses the default palette specified by the mLUT static array
and returns the RGB value without color method as a packed integer value in which:
ByteDescription
0              Blue component.
1              Green component.
2              Red component.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-valueColor Functionality as an ACI-value

OdCmEntityColor.setTrueColorMethod(System.UInt32!System.Runtime.CompilerServices.IsLong*)
\details
Converts the color method from ACIcolorMethod to ColorMethod and assumes the
current color method is ACIcolorMethod.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Color Functionality as an ACI-value

OdCmEntityColor.setTrueColor(System.UInt32!System.Runtime.CompilerServices.IsLong*)
\details
Sets the color of the calling entity with the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Working with Colors and Transparency

OdCmEntityColor.trueColorMethod(System.Int16)
\details
Converts the color method from ACIcolorMethod to ColorMethod and returns the ColorMethod value.
\param aciColorMethod [in]  ACIcolorMethod value.
\remarks
Assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value

OdCmEntityColor.trueColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the TrueColor value of the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Working with Colors and Transparency

OdCmEntityColor.setColorMethod(System.UInt32!System.Runtime.CompilerServices.IsLong*,OdCmEntityColor.ColorMethod)
\details
Sets the color method for the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param colorMethod [in]  color method as the ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.setTrueColorMethod
\details
Converts the color method from ACIcolorMethod to ColorMethod and
assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value

OdCmEntityColor.trueColorMethod
\details
Converts the color method from ACIcolorMethod to ColorMethod and returns the
ColorMethod value.
\remarks
Assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value

OdCmEntityColor.setTrueColor
\details
Sets the color of the calling entity with the entity color object.
\sa
Working with Colors and Transparency

OdCmEntityColor.trueColor
\details
Returns the TrueColor value of the entity color object.
\sa
Working with Colors and Transparency